# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя –
# школьница. Петя помогает Кате по математике. Он задумывает два
# натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для
# этого Петя делает две подсказки. Он называет сумму этих чисел S и их
# произведение P. Помогите Кате отгадать задуманные Петей числа.

# 4 4 -> 2 2
# 5 6 -> 2 3

import math
sum = int(input('Введите сумму 2х натуральных чисел от 0 да 1000: '))
prod= int(input('Введите произведение 2х натуральных чисел от 0 да 1000: '))
x=(sum+math.sqrt(sum**2-4*prod))/2
if x%1!=0:
    print('Неверный ввод!')
else:
    print(f'X= {round(x)}, Y= {sum-round(x)}')    
